#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.data.aws_secretsmanager_secret.secret: Reading...
module.domain_management.aws_route53_record.example: Refreshing state... [id=Z09261682MMR79C15BLZ9_api_A]
module.api.aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=ktjk0455h9]
module.domain_management.aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/36b7b09b-b03e-4036-8a14-dfd49c4e4fff]
module.domain_management.aws_route53_zone.thomaskimble: Refreshing state... [id=Z09261682MMR79C15BLZ9]
module.domain_management.aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_legacy_CNAME]
module.domain_management.aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z09261682MMR79C15BLZ9__TXT]
module.domain_management.aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_email_CNAME]
module.domain_management.aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_autodiscover_CNAME]
module.domain_management.aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z09261682MMR79C15BLZ9__MX]
module.frontend.data.aws_secretsmanager_secret.secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
module.frontend.data.aws_secretsmanager_secret_version.current: Reading...
module.api.aws_api_gateway_resource.about_page_content: Refreshing state... [id=l4m8i2]
module.domain_management.aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.domain_management.aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.api.aws_api_gateway_domain_name.thomaskimble_api_gateway_domain_name: Refreshing state... [id=api.thomaskimble.com]
module.frontend.data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
module.frontend.aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d212nepszzoptn]
module.api.aws_api_gateway_method.about_page_content_method: Refreshing state... [id=agm-ktjk0455h9-l4m8i2-GET]
module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.api.aws_api_gateway_method_response.about_page_content_method_response: Refreshing state... [id=agmr-ktjk0455h9-l4m8i2-GET-200]
module.api.aws_api_gateway_integration.about_page_content_integration: Refreshing state... [id=agi-ktjk0455h9-l4m8i2-GET]
module.api.aws_api_gateway_integration_response.about_page_content_integration_response: Refreshing state... [id=agir-ktjk0455h9-l4m8i2-GET-200]
module.frontend.aws_amplify_branch.dev: Refreshing state... [id=d212nepszzoptn/dev]
module.frontend.aws_amplify_branch.main: Refreshing state... [id=d212nepszzoptn/main]
module.api.aws_api_gateway_deployment.api_deployment: Refreshing state... [id=m70v03]
module.api.aws_api_gateway_stage.thomaskimble_prod: Refreshing state... [id=ags-ktjk0455h9-prod]
module.frontend.aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d212nepszzoptn/thomaskimble.com]
module.api.aws_api_gateway_base_path_mapping.thomaskimble_api_gateway_mapping: Refreshing state... [id=api.thomaskimble.com/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.domain_management.aws_route53_record.example will be destroyed
  # (because aws_route53_record.example is not in configuration)
  - resource "aws_route53_record" "example" {
      - fqdn                             = "api.thomaskimble.com" -> null
      - id                               = "Z09261682MMR79C15BLZ9_api_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "api" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z09261682MMR79C15BLZ9" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "d-ddze7947hj.execute-api.eu-west-1.amazonaws.com" -> null
          - zone_id                = "ZLY8HYME6SFDD" -> null
        }
    }

  # module.domain_management.aws_route53_record.thomaskimble_api_record will be created
  + resource "aws_route53_record" "thomaskimble_api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api"
      + type            = "A"
      + zone_id         = "Z09261682MMR79C15BLZ9"

      + alias {
          + evaluate_target_health = true
          + name                   = "d-ddze7947hj.execute-api.eu-west-1.amazonaws.com"
          + zone_id                = "ZLY8HYME6SFDD"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*